MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J11/mcu.h
// CM1CON1<CCH0>
extern volatile __bit _DEPRECATED       CCH0                __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 CCH0_bit            _BIT_ACCESS(CM1CON1,0)
// CM1CON1<CCH01>
extern volatile __bit                   CCH01               __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 CCH01_bit           _BIT_ACCESS(CM1CON1,0)
// CM2CON1<CCH02>
extern volatile __bit                   CCH02               __at(0x7E88);	// @ (0xFD1 * 8 + 0)
#define                                 CCH02_bit           _BIT_ACCESS(CM2CON1,0)
// CM1CON1<CCH1>
extern volatile __bit _DEPRECATED       CCH1                __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 CCH1_bit            _BIT_ACCESS(CM1CON1,1)
// CM1CON1<CCH11>
extern volatile __bit                   CCH11               __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 CCH11_bit           _BIT_ACCESS(CM1CON1,1)
// CM2CON1<CCH12>
extern volatile __bit                   CCH12               __at(0x7E89);	// @ (0xFD1 * 8 + 1)
#define                                 CCH12_bit           _BIT_ACCESS(CM2CON1,1)
// PORTC<CCP1>
extern volatile __bit                   CCP1                __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CCP1_bit            _BIT_ACCESS(PORTC,2)
// PORTE<CCP10>
extern volatile __bit                   CCP10               __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CCP10_bit           _BIT_ACCESS(PORTE,2)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// IPR1<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7CFA);	// @ (0xF9F * 8 + 2)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR1,2)
// ECCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DD8);	// @ (0xFBB * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(ECCP1CON,0)
// ECCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DD9);	// @ (0xFBB * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(ECCP1CON,1)
// ECCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DDA);	// @ (0xFBB * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(ECCP1CON,2)
// ECCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DDB);	// @ (0xFBB * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(ECCP1CON,3)
// ECCP1CON<CCP1X>
extern volatile __bit                   CCP1X               __at(0x7DDD);	// @ (0xFBB * 8 + 5)
#define                                 CCP1X_bit           _BIT_ACCESS(ECCP1CON,5)
// ECCP1CON<CCP1Y>
extern volatile __bit                   CCP1Y               __at(0x7DDC);	// @ (0xFBB * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(ECCP1CON,4)
// PORTE<CCP2E>
extern volatile __bit                   CCP2E               __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 CCP2E_bit           _BIT_ACCESS(PORTE,7)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D00);	// @ (0xFA0 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D08);	// @ (0xFA1 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// IPR2<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D10);	// @ (0xFA2 * 8 + 0)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR2,0)
// ECCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7DB0);	// @ (0xFB6 * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(ECCP2CON,0)
// ECCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7DB1);	// @ (0xFB6 * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(ECCP2CON,1)
// ECCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7DB2);	// @ (0xFB6 * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(ECCP2CON,2)
// ECCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7DB3);	// @ (0xFB6 * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(ECCP2CON,3)
// ECCP2CON<CCP2X>
extern volatile __bit                   CCP2X               __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 CCP2X_bit           _BIT_ACCESS(ECCP2CON,5)
// ECCP2CON<CCP2Y>
extern volatile __bit                   CCP2Y               __at(0x7DB4);	// @ (0xFB6 * 8 + 4)
#define                                 CCP2Y_bit           _BIT_ACCESS(ECCP2CON,4)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// PORTG<CCP3>
extern volatile __bit                   CCP3                __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 CCP3_bit            _BIT_ACCESS(PORTG,0)
// PIE3<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x7D20);	// @ (0xFA4 * 8 + 0)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR3,0)
// IPR3<CCP3IP>
extern volatile __bit                   CCP3IP              __at(0x7D28);	// @ (0xFA5 * 8 + 0)
#define                                 CCP3IP_bit          _BIT_ACCESS(IPR3,0)
// ECCP3CON<CCP3M0>
extern volatile __bit                   CCP3M0              __at(0x7D88);	// @ (0xFB1 * 8 + 0)
#define                                 CCP3M0_bit          _BIT_ACCESS(ECCP3CON,0)
// ECCP3CON<CCP3M1>
extern volatile __bit                   CCP3M1              __at(0x7D89);	// @ (0xFB1 * 8 + 1)
#define                                 CCP3M1_bit          _BIT_ACCESS(ECCP3CON,1)
// ECCP3CON<CCP3M2>
extern volatile __bit                   CCP3M2              __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 CCP3M2_bit          _BIT_ACCESS(ECCP3CON,2)
// ECCP3CON<CCP3M3>
extern volatile __bit                   CCP3M3              __at(0x7D8B);	// @ (0xFB1 * 8 + 3)
#define                                 CCP3M3_bit          _BIT_ACCESS(ECCP3CON,3)
// ECCP3CON<CCP3X>
extern volatile __bit                   CCP3X               __at(0x7D8D);	// @ (0xFB1 * 8 + 5)
#define                                 CCP3X_bit           _BIT_ACCESS(ECCP3CON,5)
// ECCP3CON<CCP3Y>
extern volatile __bit                   CCP3Y               __at(0x7D8C);	// @ (0xFB1 * 8 + 4)
#define                                 CCP3Y_bit           _BIT_ACCESS(ECCP3CON,4)
// PORTG<CCP4>
extern volatile __bit                   CCP4                __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 CCP4_bit            _BIT_ACCESS(PORTG,3)
// PIE3<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 CCP4IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 CCP4IF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<CCP4IP>
extern volatile __bit                   CCP4IP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 CCP4IP_bit          _BIT_ACCESS(IPR3,1)
// CCP4CON<CCP4M0>
extern volatile __bit                   CCP4M0              __at(0x7B98);	// @ (0xF73 * 8 + 0)
#define                                 CCP4M0_bit          _BIT_ACCESS(CCP4CON,0)
// CCP4CON<CCP4M1>
extern volatile __bit                   CCP4M1              __at(0x7B99);	// @ (0xF73 * 8 + 1)
#define                                 CCP4M1_bit          _BIT_ACCESS(CCP4CON,1)
// CCP4CON<CCP4M2>
extern volatile __bit                   CCP4M2              __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 CCP4M2_bit          _BIT_ACCESS(CCP4CON,2)
// CCP4CON<CCP4M3>
extern volatile __bit                   CCP4M3              __at(0x7B9B);	// @ (0xF73 * 8 + 3)
#define                                 CCP4M3_bit          _BIT_ACCESS(CCP4CON,3)
// ODCON1<CCP4OD>
extern volatile __bit                   CCP4OD              __at(0x7E7B);	// @ (0xFCF * 8 + 3)
#define                                 CCP4OD_bit          _BIT_ACCESS(ODCON1,3)
// PORTG<CCP5>
extern volatile __bit                   CCP5                __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 CCP5_bit            _BIT_ACCESS(PORTG,4)
// PIE3<CCP5IE>
extern volatile __bit                   CCP5IE              __at(0x7D1A);	// @ (0xFA3 * 8 + 2)
#define                                 CCP5IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<CCP5IF>
extern volatile __bit                   CCP5IF              __at(0x7D22);	// @ (0xFA4 * 8 + 2)
#define                                 CCP5IF_bit          _BIT_ACCESS(PIR3,2)
// IPR3<CCP5IP>
extern volatile __bit                   CCP5IP              __at(0x7D2A);	// @ (0xFA5 * 8 + 2)
#define                                 CCP5IP_bit          _BIT_ACCESS(IPR3,2)
// CCP5CON<CCP5M0>
extern volatile __bit                   CCP5M0              __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 CCP5M0_bit          _BIT_ACCESS(CCP5CON,0)
// CCP5CON<CCP5M1>
extern volatile __bit                   CCP5M1              __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 CCP5M1_bit          _BIT_ACCESS(CCP5CON,1)
// CCP5CON<CCP5M2>
extern volatile __bit                   CCP5M2              __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 CCP5M2_bit          _BIT_ACCESS(CCP5CON,2)
// CCP5CON<CCP5M3>
extern volatile __bit                   CCP5M3              __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 CCP5M3_bit          _BIT_ACCESS(CCP5CON,3)
// ODCON1<CCP5OD>
extern volatile __bit                   CCP5OD              __at(0x7E7C);	// @ (0xFCF * 8 + 4)
#define                                 CCP5OD_bit          _BIT_ACCESS(ODCON1,4)
// PORTH<CCP6>
extern volatile __bit                   CCP6                __at(0x7C3F);	// @ (0xF87 * 8 + 7)
#define                                 CCP6_bit            _BIT_ACCESS(PORTH,7)
// PORTE<CCP6E>
extern volatile __bit                   CCP6E               __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 CCP6E_bit           _BIT_ACCESS(PORTE,6)
// PORTH<CCP7>
extern volatile __bit                   CCP7                __at(0x7C3E);	// @ (0xF87 * 8 + 6)
#define                                 CCP7_bit            _BIT_ACCESS(PORTH,6)
// PORTE<CCP7E>
extern volatile __bit                   CCP7E               __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 CCP7E_bit           _BIT_ACCESS(PORTE,5)
// PORTH<CCP8>
extern volatile __bit                   CCP8                __at(0x7C3D);	// @ (0xF87 * 8 + 5)
#define                                 CCP8_bit            _BIT_ACCESS(PORTH,5)
// PORTE<CCP8E>
extern volatile __bit                   CCP8E               __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 CCP8E_bit           _BIT_ACCESS(PORTE,4)
// PORTH<CCP9>
extern volatile __bit                   CCP9                __at(0x7C3C);	// @ (0xF87 * 8 + 4)
#define                                 CCP9_bit            _BIT_ACCESS(PORTH,4)
// PORTE<CCP9E>
extern volatile __bit                   CCP9E               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 CCP9E_bit           _BIT_ACCESS(PORTE,3)
// PORTJ<CE>
extern volatile __bit                   CE                  __at(0x7C45);	// @ (0xF88 * 8 + 5)
#define                                 CE_bit              _BIT_ACCESS(PORTJ,5)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// PORTC<CK>
extern volatile __bit                   CK                  __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 CK_bit              _BIT_ACCESS(PORTC,6)
// PORTG<CK2>
extern volatile __bit                   CK2                 __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 CK2_bit             _BIT_ACCESS(PORTG,1)
// SSP1STAT<CKE>
extern volatile __bit _DEPRECATED       CKE                 __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x7B6E);	// @ (0xF6D * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP>
extern volatile __bit _DEPRECATED       CKP                 __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x7B64);	// @ (0xF6C * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// BAUDCON1<CKTXP>
extern volatile __bit                   CKTXP               __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 CKTXP_bit           _BIT_ACCESS(BAUDCON1,4)
// PORTA<CLKO>
extern volatile __bit                   CLKO                __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 CLKO_bit            _BIT_ACCESS(PORTA,6)
// RCON<CM>
extern volatile __bit                   CM                  __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 CM_bit              _BIT_ACCESS(RCON,5)
// PIE2<CM1IE>
extern volatile __bit                   CM1IE               __at(0x7D05);	// @ (0xFA0 * 8 + 5)
#define                                 CM1IE_bit           _BIT_ACCESS(PIE2,5)
// PIR2<CM1IF>
extern volatile __bit                   CM1IF               __at(0x7D0D);	// @ (0xFA1 * 8 + 5)
#define                                 CM1IF_bit           _BIT_ACCESS(PIR2,5)
// IPR2<CM1IP>
extern volatile __bit                   CM1IP               __at(0x7D15);	// @ (0xFA2 * 8 + 5)
#define                                 CM1IP_bit           _BIT_ACCESS(IPR2,5)
// PIE2<CM2IE>
extern volatile __bit                   CM2IE               __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CM2IE_bit           _BIT_ACCESS(PIE2,6)
// PIR2<CM2IF>
extern volatile __bit                   CM2IF               __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CM2IF_bit           _BIT_ACCESS(PIR2,6)
// IPR2<CM2IP>
extern volatile __bit                   CM2IP               __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CM2IP_bit           _BIT_ACCESS(IPR2,6)
// PIE2<CMIE>
extern volatile __bit                   CMIE                __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CMIE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<CMIF>
extern volatile __bit                   CMIF                __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CMIF_bit            _BIT_ACCESS(PIR2,6)
// IPR2<CMIP>
extern volatile __bit                   CMIP                __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CMIP_bit            _BIT_ACCESS(IPR2,6)
// CM1CON1<COE>
extern volatile __bit _DEPRECATED       COE                 __at(0x7E96);	// @ (0xFD2 * 8 + 6)
#define                                 COE_bit             _BIT_ACCESS(CM1CON1,6)
// CM1CON1<COE1>
extern volatile __bit                   COE1                __at(0x7E96);	// @ (0xFD2 * 8 + 6)
#define                                 COE1_bit            _BIT_ACCESS(CM1CON1,6)
// CM2CON1<COE2>
extern volatile __bit                   COE2                __at(0x7E8E);	// @ (0xFD1 * 8 + 6)
#define                                 COE2_bit            _BIT_ACCESS(CM2CON1,6)
// CM1CON1<CON>
extern volatile __bit _DEPRECATED       CON                 __at(0x7E97);	// @ (0xFD2 * 8 + 7)
#define                                 CON_bit             _BIT_ACCESS(CM1CON1,7)
// CM1CON1<CON1>
extern volatile __bit                   CON1                __at(0x7E97);	// @ (0xFD2 * 8 + 7)
#define                                 CON1_bit            _BIT_ACCESS(CM1CON1,7)
// CM2CON1<CON2>
extern volatile __bit                   CON2                __at(0x7E8F);	// @ (0xFD1 * 8 + 7)
#define                                 CON2_bit            _BIT_ACCESS(CM2CON1,7)
// CMSTAT<COUT1>
extern volatile __bit                   COUT1               __at(0x7B50);	// @ (0xF6A * 8 + 0)
#define                                 COUT1_bit           _BIT_ACCESS(CMSTAT,0)
// CMSTAT<COUT2>
extern volatile __bit                   COUT2               __at(0x7B51);	// @ (0xF6A * 8 + 1)
#define                                 COUT2_bit           _BIT_ACCESS(CMSTAT,1)
// CM1CON1<CPOL>
extern volatile __bit _DEPRECATED       CPOL                __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 CPOL_bit            _BIT_ACCESS(CM1CON1,5)
// CM1CON1<CPOL1>
extern volatile __bit                   CPOL1               __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 CPOL1_bit           _BIT_ACCESS(CM1CON1,5)
// CM2CON1<CPOL2>
extern volatile __bit                   CPOL2               __at(0x7E8D);	// @ (0xFD1 * 8 + 5)
#define                                 CPOL2_bit           _BIT_ACCESS(CM2CON1,5)
// CM1CON1<CREF>
extern volatile __bit _DEPRECATED       CREF                __at(0x7E92);	// @ (0xFD2 * 8 + 2)
#define                                 CREF_bit            _BIT_ACCESS(CM1CON1,2)
// CM1CON1<CREF1>
extern volatile __bit                   CREF1               __at(0x7E92);	// @ (0xFD2 * 8 + 2)
#define                                 CREF1_bit           _BIT_ACCESS(CM1CON1,2)
// CM2CON1<CREF2>
extern volatile __bit                   CREF2               __at(0x7E8A);	// @ (0xFD1 * 8 + 2)
#define                                 CREF2_bit           _BIT_ACCESS(CM2CON1,2)
// RCSTA1<CREN>
extern volatile __bit _DEPRECATED       CREN                __at(0x7D64);	// @ (0xFAC * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RCSTA1,4)
// RCSTA1<CREN1>
extern volatile __bit                   CREN1               __at(0x7D64);	// @ (0xFAC * 8 + 4)
#define                                 CREN1_bit           _BIT_ACCESS(RCSTA1,4)
// RCSTA2<CREN2>
extern volatile __bit                   CREN2               __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 CREN2_bit           _BIT_ACCESS(RCSTA2,4)
// PORTE<CS>
extern volatile __bit                   CS                  __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CS_bit              _BIT_ACCESS(PORTE,2)
// PMADDRH<CS1>
extern volatile __bit                   CS1                 __at(0x7B4E);	// @ (0xF69 * 8 + 6)
#define                                 CS1_bit             _BIT_ACCESS(PMADDRH,6)
// PMCONL<CS1P>
extern volatile __bit                   CS1P                __at(0x7B23);	// @ (0xF64 * 8 + 3)
#define                                 CS1P_bit            _BIT_ACCESS(PMCONL,3)
// PMADDRH<CS2>
extern volatile __bit                   CS2                 __at(0x7B4F);	// @ (0xF69 * 8 + 7)
#define                                 CS2_bit             _BIT_ACCESS(PMADDRH,7)
// PMCONL<CS2P>
extern volatile __bit                   CS2P                __at(0x7B24);	// @ (0xF64 * 8 + 4)
#define                                 CS2P_bit            _BIT_ACCESS(PMCONL,4)
// PMCONL<CSF0>
extern volatile __bit                   CSF0                __at(0x7B26);	// @ (0xF64 * 8 + 6)
#define                                 CSF0_bit            _BIT_ACCESS(PMCONL,6)
// PMCONL<CSF1>
extern volatile __bit                   CSF1                __at(0x7B27);	// @ (0xF64 * 8 + 7)
#define                                 CSF1_bit            _BIT_ACCESS(PMCONL,7)
// TXSTA1<CSRC>
extern volatile __bit _DEPRECATED       CSRC                __at(0x7D6F);	// @ (0xFAD * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA1,7)
// TXSTA1<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D6F);	// @ (0xFAD * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA1,7)
// TXSTA2<CSRC2>
extern volatile __bit                   CSRC2               __at(0x7D47);	// @ (0xFA8 * 8 + 7)
#define                                 CSRC2_bit           _BIT_ACCESS(TXSTA2,7)
// CVRCON<CVR0>
extern volatile __bit                   CVR0                __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 CVR0_bit            _BIT_ACCESS(CVRCON,0)
// CVRCON<CVR1>
extern volatile __bit                   CVR1                __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 CVR1_bit            _BIT_ACCESS(CVRCON,1)
// CVRCON<CVR2>
extern volatile __bit                   CVR2                __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 CVR2_bit            _BIT_ACCESS(CVRCON,2)
// CVRCON<CVR3>
extern volatile __bit                   CVR3                __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 CVR3_bit            _BIT_ACCESS(CVRCON,3)
// PORTF<CVREF>
extern volatile __bit                   CVREF               __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 CVREF_bit           _BIT_ACCESS(PORTF,5)
// CVRCON<CVREN>
extern volatile __bit                   CVREN               __at(0x7BBF);	// @ (0xF77 * 8 + 7)
#define                                 CVREN_bit           _BIT_ACCESS(CVRCON,7)
// CVRCON<CVROE>
extern volatile __bit                   CVROE               __at(0x7BBE);	// @ (0xF77 * 8 + 6)
